In [1]:
import pandas as pd

In [2]:
people = {
    "first" :["Ram","Hari","Shyam"],
    "last" : ["Thapa","Paudel","Oli"],
    "email" : ["ramthaapa@gmail.com","haripaudel@gmail.com","shyamoli@gmail.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                 email
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
2  Shyam     Oli    shyamoli@gmail.com

In [5]:
df.columns  # dataframe maa bhako columns  ko list dinxa

Index(['first', 'last', 'email'], dtype='object')

In [6]:
# modifying columns
df.columns = ['First_name','Last_name','email']  # yo tarila bata column name modify garda sabai column name lekhna parxa

# using this way to modify the column name we have to modify all columns as above otherwise it gives error

In [7]:
df.columns

Index(['First_name', 'Last_name', 'email'], dtype='object')

In [8]:
df

  First_name Last_name                 email
0        Ram     Thapa   ramthaapa@gmail.com
1       Hari    Paudel  haripaudel@gmail.com
2      Shyam       Oli    shyamoli@gmail.com

In [9]:
df.columns = [x.upper() for x in df.columns]  # using list colprehension to make all column name in uppercase
df

  FIRST_NAME LAST_NAME                 EMAIL
0        Ram     Thapa   ramthaapa@gmail.com
1       Hari    Paudel  haripaudel@gmail.com
2      Shyam       Oli    shyamoli@gmail.com

In [10]:
df.columns = df.columns.str.replace('_',' ')  # replacing _ with blank space on  columns using str.replace method
df

  FIRST NAME LAST NAME                 EMAIL
0        Ram     Thapa   ramthaapa@gmail.com
1       Hari    Paudel  haripaudel@gmail.com
2      Shyam       Oli    shyamoli@gmail.com

In [11]:
df.columns = [x.lower() for x in df.columns] # lowercase banako  
df

  first name last name                 email
0        Ram     Thapa   ramthaapa@gmail.com
1       Hari    Paudel  haripaudel@gmail.com
2      Shyam       Oli    shyamoli@gmail.com

In [12]:
df.columns = df.columns.str.replace(' ',' _') # space ko thau maa _ banako
df

  first _name last _name                 email
0         Ram      Thapa   ramthaapa@gmail.com
1        Hari     Paudel  haripaudel@gmail.com
2       Shyam        Oli    shyamoli@gmail.com

In [13]:
df

  first _name last _name                 email
0         Ram      Thapa   ramthaapa@gmail.com
1        Hari     Paudel  haripaudel@gmail.com
2       Shyam        Oli    shyamoli@gmail.com

# Modifying datas in rows and columns

In [14]:
df

  first _name last _name                 email
0         Ram      Thapa   ramthaapa@gmail.com
1        Hari     Paudel  haripaudel@gmail.com
2       Shyam        Oli    shyamoli@gmail.com

In [15]:
# changing last_name and email of Shyam

df.loc[2] =['Shyam','Khadka','shyamkhadka@gmail.com']

In [16]:
df

  first _name last _name                  email
0         Ram      Thapa    ramthaapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam     Khadka  shyamkhadka@gmail.com

In [17]:
df.loc[2]

first _name                    Shyam
last _name                    Khadka
email          shyamkhadka@gmail.com
Name: 2, dtype: object

In [18]:
df.loc[2,['last _name','email']]=['Sharma','shyamsharma@gmail.com']  # modifying data of a row of index 2

In [19]:
df

  first _name last _name                  email
0         Ram      Thapa    ramthaapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam     Sharma  shyamsharma@gmail.com

In [20]:
df.loc[0,'email'] ='ramthapa@gmail.com' # we can change a single data tooo

In [21]:
df

  first _name last _name                  email
0         Ram      Thapa     ramthapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam     Sharma  shyamsharma@gmail.com

In [22]:
# can use .at method instead of .loc method
# .at[] is used to to get or set a single value of row/column label in a DataFrame or Series.

df.at[2,'last _name'] = 'Oli'

In [23]:
df

  first _name last _name                  email
0         Ram      Thapa     ramthapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam        Oli  shyamsharma@gmail.com

In [24]:

filt = (df['email']) == 'ramthapa@gmail.com' # applying filter directly on the df to modify data provides an error
df[filt]['last _name'] = 'Poudel'

/tmp/ipykernel_10941/3292814344.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last _name'] = 'Poudel'

In [25]:
df

  first _name last _name                  email
0         Ram      Thapa     ramthapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam        Oli  shyamsharma@gmail.com

In [26]:
filt = (df['email']) == 'ramthapa@gmail.com'  # but using .loc method doesn't provides an error
df.loc[filt,['last _name']] = 'Poudel'

In [27]:
df

  first _name last _name                  email
0         Ram     Poudel     ramthapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam        Oli  shyamsharma@gmail.com

Updating multiple rows of data :-

In [28]:
# changing all data of email column to uppercase
df['email'].str.upper() # email column ko sabai data lai uppercase baneko

# this doesn't change our original dataframe

0       RAMTHAPA@GMAIL.COM
1     HARIPAUDEL@GMAIL.COM
2    SHYAMSHARMA@GMAIL.COM
Name: email, dtype: object

In [29]:
#df['email']=df['email'].str.upper()  # doing this changes our original dataframe

In [30]:
df

  first _name last _name                  email
0         Ram     Poudel     ramthapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam        Oli  shyamsharma@gmail.com

#  Methods to change multiple rows at once :-

# 1) apply:- works on dataframe or series object

       applying apply on series object :--

In [31]:


df['email'].apply(len)   # gives the length of all emails in email column

0    18
1    20
2    21
Name: email, dtype: int64

In [32]:
# defining a simple function that returns the uppercase version of email column


def upd_email(email):
  return email.upper()

In [33]:
df['email'].apply(upd_email)

0       RAMTHAPA@GMAIL.COM
1     HARIPAUDEL@GMAIL.COM
2    SHYAMSHARMA@GMAIL.COM
Name: email, dtype: object

In [34]:
df['email'] = df['email'].apply(upd_email)  #  this changes data  in dataframe

In [35]:
df

  first _name last _name                  email
0         Ram     Poudel     RAMTHAPA@GMAIL.COM
1        Hari     Paudel   HARIPAUDEL@GMAIL.COM
2       Shyam        Oli  SHYAMSHARMA@GMAIL.COM

In [36]:
df['email'] = df['email'].apply(lambda x:x.lower())  # using lambda function instead of defining a function as above

In [37]:
df

  first _name last _name                  email
0         Ram     Poudel     ramthapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam        Oli  shyamsharma@gmail.com

   applying apply on dataframe :--

In [38]:
df['email'].apply(len) # this gives the length of series

0    18
1    20
2    21
Name: email, dtype: int64

In [39]:
# applying .apply(len) to the entire dataframe
df.apply(len) # this gives the value that each column has => dataframe ko sabai column maa kati ota data xa dekhauxa

first _name    3
last _name     3
email          3
dtype: int64

In [40]:
# getting min value of each column of dataframe
df.apply(pd.Series.min) # yedi dataframe ko each column or series object ko sabai vanda minimun value nikalna cha vani yesari pd.Series.min use garera nikalna sakincha

first _name                    Hari
last _name                      Oli
email          haripaudel@gmail.com
dtype: object

df.apply(lambda x:x.min())  # getting min value of each column usinf lambda

# 2) applymap method :-

# ---> this method only works on dataframe

In [41]:
df.applymap(len) # this gives the length of each element/data in dataframe

   first _name  last _name  email
0            3           6     18
1            4           6     20
2            5           3     21

In [42]:
df.applymap(str.lower)  # makes all data lowercased ,if we had had any numerical value then it gives error i.e because we can't run string methods on numeric data

  first _name last _name                  email
0         ram     poudel     ramthapa@gmail.com
1        hari     paudel   haripaudel@gmail.com
2       shyam        oli  shyamsharma@gmail.com

# 3)map method :-

# ---> this method only works on series,map is used for substituting each value in a series with another value

     applying map method:-

In [43]:
df['first _name']

0      Ram
1     Hari
2    Shyam
Name: first _name, dtype: object

In [44]:
df['first _name'].map({'Ram':'chris','Hari':'harry'})  # we will understand this clearly while working on real world data

0    chris
1    harry
2      NaN
Name: first _name, dtype: object

In [45]:
df

  first _name last _name                  email
0         Ram     Poudel     ramthapa@gmail.com
1        Hari     Paudel   haripaudel@gmail.com
2       Shyam        Oli  shyamsharma@gmail.com

# 4) replace method :-
# ---> this method works on both series object and dataframe

    applying replace method :-

In [46]:

df['first _name'].replace({'Ram': 'Chris', 'Hari': 'Harry'}) # this replaces Ram with Chris and Hari with Harry

0    Chris
1    Harry
2    Shyam
Name: first _name, dtype: object

In [47]:
# we can change the dataframe as 

df['first _name'] = df['first _name'].replace({'Ram': 'Chris', 'Hari': 'Harry'})

In [48]:
df

  first _name last _name                  email
0       Chris     Poudel     ramthapa@gmail.com
1       Harry     Paudel   haripaudel@gmail.com
2       Shyam        Oli  shyamsharma@gmail.com